<!DOCTYPE html>
<html lang="zh-Hans">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
    <title>China Certificate</title>
    <style>
           @page {
            margin: 0cm 0cm;
        }
        .page-break {
            page-break-after: always;
        }
        body {
            margin: 1cm;
        }
        /* @font-face {
            font-family: 'Firefly Sung';
            font-style: normal;
            font-weight: 500;
            src: url(http://eclecticgeek.com/dompdf/fonts/cjk/fireflysung.ttf) format('truetype');
        } */
        @font-face {
            font-family: 'ipag';
            font-style: normal;
            font-weight: normal;
            src: url(/var/www/html/react-test/storage/fonts/ipag.ttf) format('truetype');
        }
        * {
            font-family: ipag ,Firefly Sung, DejaVu Sans, Verdana, Arial, sans-serif;
        }
    </style>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
</head>
<body>
    <p>China Font</p>
    <p>涵盖从孟加拉国出口到大韩民国的水生动物和水生动物产品</p>
    <p>Japanese Font</p>

    日本にほんでは、近頃ちかごろ多おおくの人ひとが保育園ほいくえん問題もんだいについて話はなしている。
    特とくに東京とうきょうでは十分じゅうぶんな施設しせつがないので、
    子こどもを保育園ほいくえんに入いれることがとても大変たいへんだ。
    今いま私わたしは東京とうきょうに住すんでいるので、
    息子むすこを保育園ほいくえんに入いれるのは不可能ふかのうだろうと思おもっていた。
    しかし驚おどろいたことに、
    息子むすこは受うけ入いれてもらえた</p>
    <p>Updated Text</p>
    <p>ヘンドリックソンがあのデパートでアーロンのセーターを買いました。
    埼玉(さいたま)県(けん)は　東京(とうきょう)の　すぐ北(きた)に　あります。桜(さくら)など　季節(きせつ)ごとに　さまざまな　花(はな)が　楽(たの)しめます　が、　なかでも　秩父(ちちぶ)市(し)の　羊山(ひつじやま)公園(こうえん)で　春(はる)に　見(み)られる　芝桜(しばざくら)は　有名です。
    このほかにも、　世界(せかい)で　初(はじ)めての　盆栽(ぼんさい)美術館(びじゅつかん)、　古(ふる)い　町並(まちな)みを　見(み)ることが　できる　川越(かわごえ)、　そして　各地(かくち)で　行われている　祭(まつ)り　なども　見逃(みのが)せません。
    
    また、　渓谷(けいこく)を　眺(なが)めながら　荒川(あらかわ)を　舟(ふね)で　下(くだ)る　長瀞(ながとろ)の　ラインくだり、　大宮(おおみや)の　鉄道(てつどう)博物館(はくぶつかん)での　電車(でんしゃ)の　運転(うんてん)体験(たいけん)や　乗車(じょうしゃ)体験(たいけん)　などの　アクティビティは、　子(こ)どもから　大人(おとな)まで　楽(たの)しむことが　できます。
    
    観光(かんこう)や　体験(たいけん)を　したあとには、　おいしい　食事(しょくじ)を　楽(たの)しみましょう。　自然(しぜん)の　多(おお)い　埼玉(さいたま)県(けん)の　秩父(ちちぶ)地域(ちいき)では、　きれいな水(みず)で　育(そだ)った　天然(てんねん)の　鮎(あゆ)や　天然(てんねん)氷(ごおり)を　使(つか)った　かき氷(ごおり)が　味(あじ)わえます。　東京(とうきょう)に　近(ちか)い　浦和(うらわ)エリアには、　伝統(でんとう)の　味(あじ)である　おいしい　うなぎを　提供(ていきょう)する　店(みせ)も　ありますよ。
    アウトレットや　ショッピングモールも　たくさん　あるので、　買(か)い物(もの)を　楽(たの)しむのも　オススメです。
    
    埼玉(さいたま)県(けん)に　宿泊(しゅくはく)する　なら、　豊(ゆた)かな　自然(しぜん)の　中(なか)で　風情(ふぜい)ある　昔(むかし)の　日本(にほん)を　感(かん)じられる　温泉(温泉)旅館(旅館)から、　東京(とうきょう)都内(とない)からの　アクセスが　便利(べんり)で　ショッピングモールなどに　近(ちか)い　ホテル　など　まで、　目的(もくてき)に　合(あ)わせて　施設(しせつ)を　選(えら)ぶ　ことが　できます。
    
    東京(とうきょう)から　アクセスがよく、　見(み)どころ　満載(まんさい)の　埼玉(さいたま)の　魅力(みりょく)を　ご紹介(しょうかい)します。
    </p>
    <p>New Text</p>
    <p>
        アルフレッドはキウイやオレンジやストロベリーやすっぱいのくだものがすきですよ
マクドナルドとメリンダはロマンチックカップルです。
このビルディングのべースメントはレストランとカフェがあります。
スティープンはスーパーマーケットでチョコレートとレッドキャベジとマヨネーズがかいました。
    </p>

</body>
</html>